httperf-logs/persistent/test3.txt
httperf --timeout=5 --client=0/1 --server=localhost --port=18000 --uri=/www.cs.toronto.edu/~ylzhang/csc258/memes.html --rate=10 --send-buffer=4096 --recv-buffer=16384 --num-conns=100 --num-calls=30
Maximum connect burst length: 1

Total: connections 100 requests 3000 replies 3000 test-duration 9.904 s

Connection rate: 10.1 conn/s (99.0 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 2.1 avg 3.7 max 11.6 median 3.5 stddev 1.7
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 30.000

Request rate: 302.9 req/s (3.3 ms/req)
Request size [B]: 107.0

Reply rate [replies/s]: min 300.0 avg 300.0 max 300.0 stddev 0.0 (1 samples)
Reply time [ms]: response 0.1 transfer 0.0
Reply size [B]: header 90.0 content 4148.0 footer 0.0 (total 4238.0)
Reply status: 1xx=0 2xx=3000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 5.07 system 4.76 (user 51.2% system 48.0% total 99.3%)
Net I/O: 1285.2 KB/s (10.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0